{"data":{"site":{"siteMetadata":{"title":"Managing Reflections","author":"Dan Applegate"}},"markdownRemark":{"id":"575d4aaf-dd12-537a-81ef-19685de568d6","excerpt":"A few years ago, I got the idea that I should start a blog. I was a software engineer, working at a startup in New York City, and I was learning a ton of…","html":"<p>A few years ago, I got the idea that I should start a blog. I was a software engineer, working at a startup in New York City, and I was learning a ton of exciting things about building software. I wanted to share them. I promptly bought a domain, cloned a static site generator, published my first post, and patted myself on the back.</p>\n<p>I never touched the blog again.</p>\n<p>Now that I am a few years older and a manager of engineers, I wonder what I would say if I could meet with my former self in a one-on-one. One of my favorite parts of being a manager is working directly with my reports. I love helping them reach their goals. It’s the most rewarding part of my job, seeing their self-confidence and determination grow. Perhaps a part of me feels like I’m conquering my own unfocused nature – if only vicariously – and that if I can just practice what I preach, I can accomplish every halfway ambitious thing I set out to do.</p>\n<p>Including this. Writing is a laborious process for me, so maintaining a regularly updated blog is a bit intimidating. Whenever I read authors’ reflections on their own writing process, I’m always amazed at how straightforward they make it sound. First you write the first draft, then second, third, fourth. Revisions and rewrites. Writing something down without giving it too much thought, simply to get <em>something</em> down. They talk about the importance of regular writing and setting a goal for oneself – say, 1,000 words a day – and sticking to it, no matter what.</p>\n<p>For me, that sounds terrible. When I write, I agonize over every sentence before I write it. I hate going back over my draft work and second-guessing myself, because I can usually argue myself in circles about what would sound best. Perhaps I can reduce that friction over time and get to the point where 1,000 words a day doesn’t seem so impossible. I don’t know.</p>\n<p>What I do know is that I’m feeling that itch to write again. I’m learning so many new things about software management and I want to share them. I want to test those ideas against what others have found and see if there isn’t a better way. And maybe through the act of writing these posts, the practice of maintaining this blog, I’ll become better at simply writing down my thoughts before I stop to think.</p>\n<p>One piece of advice that I’ve always found invaluable when faced with a large task is to break it apart into smaller, more immediately accomplishable goals. Writing a single blog post doesn’t seem so bad. Hopefully this post will be the precursor to another, and then another, and before long, I’ll have a well-maintained and regularly updated blog. Even if nobody reads it, it will at least have taught me to write better.</p>\n<p>If nothing else, my former self will be impressed.</p>","frontmatter":{"title":"Hello World!","date":"June 09, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/hello-world/","previous":null,"next":{"fields":{"slug":"/whats-in-a-name/"},"frontmatter":{"title":"What's in a name?"}}}}